# **Описание**: Создайте программу для форматирования персональной информации с помощью f-строк
# **Входные данные**: Используйте встроенные переменные с данными пользователя
# **Выходные данные**: Отформатированная строка с персональной информацией
# **Ограничения**: Используйте только f-строки для форматирования
# **Примеры**:
# Входные данные: name = "Анна", age = 25, city = "Москва"
# Выходные данные: "Меня зовут Анна, мне 25 лет, я живу в городе Москва"
# Входные данные: name = "Иван", age = 30, city = "Санкт-Петербург"
# Выходные данные: "Меня зовут Иван, мне 30 лет, я живу в городе Санкт-Петербург"

# Данные пользователя
name = "Анна"
age = 25
city = "Москва"

# Ваш код здесь
print(f"Меня зовут {name}, мне {age} лет, я живу в городе {city}")