# **Описание**: Создайте программу для экранирования кавычек в строках
# **Входные данные**: Используйте встроенные переменные с текстовыми значениями, содержащими кавычки
# **Выходные данные**: Строки с правильно экранированными кавычками
# **Ограничения**: Используйте только escape-символы \" и \' для экранирования кавычек

# Ваш код здесь
quote1 = "Он сказал: \"Привет!\""
quote2 = "Он сказал: 'Привет!'"
quote3 = 'Он сказал: "Привет!"'

print(quote1)
print(quote2)