# **Описание**: Создайте программу для замены подстрок в тексте с помощью метода replace()
# **Входные данные**: Используйте встроенную переменную text с исходным текстом
# **Выходные данные**: Результат замены подстроки в тексте
# **Ограничения**: Используйте только метод replace() для замены подстрок
# **Примеры**:
# Входные данные: text = "Я изучаю Java программирование"
# Выходные данные: Я изучаю Python программирование
# Входные данные: text = "Сегодня плохая погода"
# Выходные данные: Сегодня хорошая погода

# Ваш код здесь
text = "Я изучаю Java программирование"

print(text.replace("Java", "Python"))