# **Описание**: Создайте программу для объединения элементов списка в строку с помощью метода join()
# **Входные данные**: Используйте встроенную переменную items с готовым списком строк
# **Выходные данные**: Строка с элементами, объединенными через разделитель
# **Ограничения**: Используйте только метод join() для объединения элементов
# **Примеры**:
# Входные данные: items = ['понедельник', 'вторник', 'среда']
# Выходные данные: понедельник-вторник-среда
# Входные данные: items = ['красный', 'синий', 'зеленый']
# Выходные данные: красный-синий-зеленый

items = ['понедельник', 'вторник', 'среда']

print("-".join(items))