# **Описание**: Создайте программу для преобразования строки с помощью методов upper() и lower()
# **Входные данные**: Используйте встроенную переменную message с текстовым значением
# **Выходные данные**: Результаты преобразования строки в верхний и нижний регистр
# **Ограничения**: Используйте только методы upper() и lower()
# **Примеры**:
# Входные данные: message = "Добро Пожаловать В Python"
# Выходные данные:
# Верхний регистр: ДОБРО ПОЖАЛОВАТЬ В PYTHON
# Нижний регистр: добро пожаловать в python

message = "Добро Пожаловать В Python"

print(message.upper())
print(message.lower())