# **Описание**: Создайте константы для хранения настроек приложения и выведите их значения
#
# **Входные данные**: Нет (используйте встроенные значения в коде)
#
# **Выходные данные**: Значения констант, выведенные с помощью функции print()
#
# **Ограничения**: Используйте соглашение по именованию констант (CAPS) и базовые типы данных Python: int, float, str, bool
#
# **Примеры**:
# Вывод должен содержать значения в формате:
# 100
# 1.5
# MyApp
# True

MAX_CONNECTIONS = 100
TIMEOUT = 1.5
APP_NAME = "MyApp"
IS_DEBUG = True

print(MAX_CONNECTIONS)
print(TIMEOUT)
print(APP_NAME)
print(IS_DEBUG)