# **Описание**: Создайте переменные для хранения данных о книге и исправьте некорректные имена переменных
#
# **Входные данные**: Нет (используйте встроенные значения в коде)
#
# **Выходные данные**: Значения переменных с корректными именами, выведенные с помощью функции print()
#
# **Ограничения**: Исправьте некорректные имена переменных согласно правилам Python: не начинать с цифры, не использовать дефисы, не использовать пробелы
#
# **Примеры**:
# Вывод должен содержать значения в формате:
# Программирование на Python
# 2023
# 29.99
# True

# Исправьте некорректные имена переменных:
# 1title -> 
# book-year -> 
# book price -> 
# is available -> 

title = "Программирование на Python"
year = 2023
price = 29.99
is_available = True

print(title)
print(year)
print(price)
print(is_available)