# **Описание**: Создайте переменные для хранения информации о товаре и выведите их значения
#
# **Входные данные**: Нет (используйте встроенные значения в коде)
#
# **Выходные данные**: Значения переменных, выведенные с помощью функции print()
#
# **Ограничения**: Используйте только базовые типы данных Python: int, float, str, bool
#
# **Примеры**:
# Вывод должен содержать значения в формате:
# Яблоки
# 50
# 2.5
# True

fruit_name = "Яблоки"
fruit_price = 50
fruit_weight = 2.5
fruit_is_available = True

print(fruit_name)
print(fruit_price)
print(fruit_weight)
print(fruit_is_available)