# **Описание**: Создайте переменные для хранения информации о пользователе и выведите их типы
#
# **Входные данные**: Нет (используйте встроенные значения в коде)
#
# **Выходные данные**: Типы переменных, выведенные с помощью функции type()
#
# **Ограничения**: Используйте только базовые типы данных Python: int, float, str, bool
#
# **Примеры**:
# Вывод должен содержать типы в формате:
# <class 'int'>
# <class 'float'>
# <class 'str'>
# <class 'bool'>

person_name = "John"
person_age = 30
person_height = 1.80
person_is_student = True

print(type(person_name))
print(type(person_age))
print(type(person_height))
print(type(person_is_student))
