# **Описание**: Создайте переменные для хранения информации о рецепте блюда и выведите их в читаемом формате
#
# **Входные данные**: Нет (используйте встроенные значения в коде)
#
# **Выходные данные**: Информация о рецепте, выведенная с помощью функции print()
#
# **Ограничения**: Используйте только базовые типы данных Python: int, float, str, bool. Создайте переменные для названия блюда, времени приготовления, количества порций и доступности ингредиентов
#
# **Примеры**:
# Вывод должен содержать информацию в формате:
# Блюдо: Борщ
# Время приготовления: 45 минут
# Количество порций: 4
# Все ингредиенты доступны: True

dish_name = "Борщ"
dish_time = 45
dish_portions = 4
dish_ingredients_available = True

print(dish_name)
print(dish_time)
print(dish_portions)
print(dish_ingredients_available)