# **Описание**: Создайте переменные для хранения информации о студенте и выполните явное преобразование типов
#
# **Входные данные**: Нет (используйте встроенные значения в коде)
#
# **Выходные данные**: Результаты преобразования типов, выведенные с помощью функции print()
#
# **Ограничения**: Используйте функции int(), float(), str(), bool() для явного преобразования типов
#
# **Примеры**:
# Вывод должен содержать преобразованные значения в формате:
# 25
# 25.0
# 25
# True

ball_of_student = "25"

print(int(ball_of_student))
print(float(ball_of_student))
print(str(ball_of_student))
print(bool(ball_of_student))