# **Описание**: Создайте переменные с подсказками типов и выведите их значения
#
# **Входные данные**: Нет (используйте встроенные значения в коде)
#
# **Выходные данные**: Значения переменных, выведенные с помощью функции print()
#
# **Ограничения**: Используйте подсказки типов (type hints) для каждой переменной: int, float, str, bool
#
# **Примеры**:
# Вывод должен содержать значения в формате:
# 30
# 15.5
# John
# True

person_age: int = 30
person_height: float = 1.80
person_name: str = "John"
person_is_student: bool = True

print(person_age)
print(person_height)
print(person_name)
print(person_is_student)