# **Описание**: Создайте переменные для хранения данных о фильме и выполните одновременное присвоение нескольких значений
#
# **Входные данные**: Нет (используйте встроенные значения в коде)
#
# **Выходные данные**: Значения переменных, выведенные с помощью функции print()
#
# **Ограничения**: Используйте одновременное присвоение для создания переменных с информацией о фильме (название, год, рейтинг, доступность)
#
# **Примеры**:
# Вывод должен содержать значения в формате:
# Интерстеллар
# 2014
# 8.6
# True

move_title, move_year, move_rating, move_is_available = "Интерстеллар", 2014, 8.6, True

print(move_title)
print(move_year)
print(move_rating)
print(move_is_available)