# **Описание**: Создайте программу для работы с данными о книгах в библиотеке
#
# **Входные данные**: Список books содержащий названия книг
#
# **Выходные данные**:
# - Общее количество книг в списке
# - Первая книга в списке
# - Последняя книга в списке
# - Новый список с книгами, названия которых содержат более 10 символов
# - Новый список с первыми 3 символами каждого названия
#
# **Ограничения**: Список содержит минимум 3 книги
#
# **Примеры**:
# Input: books = ["Война и мир", "1984", "Преступление и наказание"]
# Output:
# Общее количество книг: 3
# Первая книга: Война и мир
# Последняя книга: Преступление и наказание
# Длинные названия: ["Преступление и наказание"]
# Первые 3 символа: ["Вой", "198", "Пре"]
#
# Входные данные: books = ["Гарри Поттер", "Хоббит", "Властелин колец"]
# Output:
# Общее количество книг: 3
# Первая книга: Гарри Поттер
# Последняя книга: Властелин колец
# Длинные названия: ["Гарри Поттер", "Властелин колец"]
# Первые 3 символа: ["Гар", "Хоб", "Вла"]

# Данные для работы
books = ["Война и мир", "1984", "Преступление и наказание"]

print(f"Общее количество книг: {len(books)}")
print(f"Первая книга: {books[0]}")
print(f"Последняя книга: {books[-1]}")
print(f"Длинные названия: {[book for book in books if len(book) > 10]}")
print(f"Первые 3 символа: {[book[:3] for book in books]}")
