a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(f"a: {a}")
print(f"a[0:3]: {a[0:3]}")
print(f"a[:3]: {a[:3]}")
print(f"a[6:]: {a[6:]}")

# А можно еще и настроить шаг
print(f"Выведем каждый второй элемент списка a[::2]: {a[::2]}")
print(f"Выдем часть списка в обратном порядке a[8:3:-1]: {a[8:3:-1]}")

# Кроме списком можно и строки нарезать
s = "Hello, World!"
print(f"Строка: {s}")
print(f"s[0:5]: {s[0:5]}")
print(f"s[:5]: {s[:5]}")
print(f"s[7:]: {s[7:]}")
print(f"Выведем каждый второй элемент строки s[::2]: {s[::2]}")
print(f"Выдем часть строки в обратном порядке s[8:3:-1]: {s[8:3:-1]}")
